#define  _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
#include <string.h>

/**
*
* 枚举：其基本思想就是逐一列举问题的所有情形，
*		并根据问题提出的条件逐一检验哪些问题的解。
*
* 枚举的模式：（1）区间枚举
*					n = 0;
*　　				for(k=<区间下限>; k<=<区间上限>; k++)
*					{
*						<运算操作序列>;
*　　　　				if(<约束条件>){
*							printf(<满足要求的解>);
*							n++;
*						}
*　　				}
*					printf(<解的个数>);
*			  （2）递增枚举
*					k = 0;
*					while(1) {
*						k++;
*						<运算操作序列>;
*						if(<序列约束>) {
*							printf(<满足要求的解>);
*							return;
*						}
*					}
*		
*
*
*/


/*********** 2.2 统计求和 *************/

// 2.2.1 同码小数 
// 整数部分为零，小数部分各位数字相同的小数称为同码小数。
// 例如0.3，0.33，0.333，...是同数码3的小数。
// 记：
//	s(d,n)= 0.d+0.dd+0.ddd+…+0.dd…d
//	w(d,n)=0.d+2×0.dd+3×0.ddd+…+n×0.dd…d
//	两和式为n项之和，其中第k项小数点后有k个数字d，加权和第k项的权系数为k
// Q&A:
//	依次输入整数d(1≤d≤9)，n(1≤n<10000)
//	(1)求s(d,n)与w(d,n)（四舍五入精确到小数点后6位）。
//  (2)试精确求和s(d,n)与w(d,n)。
void test2_2_1() {
	int d = 0, n = 0;

	printf("输入整数d, n ");
	scanf("%d %d", &d, &n);

	double s = 0;
	double w = 0;
	double t = 0;

	for (int i = 1; i <= n; i++) {

		// t为s的第i项
		t = t/10 + 0.1*d;
		s += t;
		w += t * i;
	}

	printf("四舍五入精确到小数点后6位的结果是: \n");
	printf("s(%d, %d) = %.6f\n", d, n, s);
	printf("w(%d, %d) = %.6f\n", d, n, w);

	// 问题2
	// 用数组来保存结果
	long t2 = 0, s2[1024] = { 0 }, w2[1024] = { 0 };

	for (int i = n; i >= 1; i--) {
		t2 = t2 + i;
		s2[i] = (n - i + 1) * d;
		w2[i] = t2 * d;
	}

	for (int i = n; i >= 1; i--) {
		s2[i - 1] = s2[i - 1] + s2[i] / 10;
		s2[i] = s2[i] % 10;
		w2[i - 1] = w2[i - 1] + w2[i] / 10;
		w2[i] = w2[i] % 10;
	}

	int m = 10; // 比较相应小数位上相等的位数
	for (int i = 1; i <= n; i++) {
		if (w2[i] == s2[i])
			m++;
	}

	printf("精确结果：\n");
	printf("s2(%d, %d) = %ld.", d, n, s2[0]);
	for (int i = 1; i <= n; i++)
		printf("%ld", s2[i]);
	
	printf("\nw2(%d, %d) = %ld.", d, n, w2[0]);
	for (int i = 1; i <= n; i++)
		printf("%ld", w2[i]);

	return;
}

void test2_2() {

	test2_2_1();
}

/************ 2.3 整数搜索 ***************/

// 2.3.1 整数对
// 设b是正整数a去掉一个数字后的正整数，
// 对于给出的正整数n，寻求满足和式a+b=n的所有正整数对a,b。
// 例如，n = 34, 则满足的有（27,7）、（31,3）、（32,2）
void test2_3_1() {

}


/**************************************/
int main() {


	test2_2();
	

	getch();
	return 0;
}
